T0n0T/stm32/drivers/camera.c
#include "camera.h"
#include "i2c_soft.h"
#include "stm32h7xx_hal_dcmi.h"
#include <stdint.h>

#define OV5640_SCCB_ADDRESS 0x3c       // OV5640地址
#define OV5640_SCCB_BUS     I2C_SOFT_1 // 使用的I2C总线索引
#define OV5640_DELAY_MS(x)  HAL_Delay(x)

extern DCMI_HandleTypeDef hdcmi;
extern DMA_HandleTypeDef  hdma_dcmi;

camera_ins_t camera_ins;

void HAL_DCMI_FrameEventCallback(DCMI_HandleTypeDef* hdcmi)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hdcmi);

    camera_ins.capture_ok = 1;
}

static inline void ov5640_write_reg16_byte(uint16_t reg, uint8_t data)
{
    uint8_t buf[4] = {
        (uint8_t)OV5640_SCCB_ADDRESS,
        (uint8_t)((reg) >> 8),
        (uint8_t)(reg),
        (uint8_t)data,
    };
    i2c_soft_start(OV5640_SCCB_BUS);
    i2c_soft_write_bytes(OV5640_SCCB_BUS, buf, 4);
    i2c_soft_stop(OV5640_SCCB_BUS);
}

static inline uint8_t ov5640_read_reg16_byte(uint16_t reg)
{
    uint8_t data;
    uint8_t buf[3] = {
        (uint8_t)OV5640_SCCB_ADDRESS,
        (uint8_t)((reg) >> 8),
        (uint8_t)(reg),
    };
    uint8_t read_addr = OV5640_SCCB_ADDRESS << 1 | 0x01; // 7位地址转换为8位地址
    i2c_soft_start(OV5640_SCCB_BUS);
    i2c_soft_write_bytes(OV5640_SCCB_BUS, buf, 2);
    i2c_soft_stop(OV5640_SCCB_BUS);
    i2c_soft_start(OV5640_SCCB_BUS);
    i2c_soft_write_bytes(OV5640_SCCB_BUS, &read_addr, 1);
    i2c_soft_read_bytes(OV5640_SCCB_BUS, &data, 1);
    i2c_soft_stop(OV5640_SCCB_BUS);
    return data;
}

static inline void ov5640_write_reg16_bytes(uint16_t reg, uint8_t* data,
                                            uint8_t len)
{
    uint8_t buf[3] = {
        (uint8_t)OV5640_SCCB_ADDRESS,
        (uint8_t)((reg) >> 8),
        (uint8_t)(reg),
    };
    i2c_soft_start(OV5640_SCCB_BUS);
    i2c_soft_write_bytes(OV5640_SCCB_BUS, buf, 3);
    i2c_soft_write_bytes(OV5640_SCCB_BUS, data, len);
    i2c_soft_stop(OV5640_SCCB_BUS);
}

uint16_t camera_read_id(void)
{
    uint16_t id = 0;

    id = ov5640_read_reg16_byte(OV5640_CHIP_ID_LOW_BYTE);
    id |= ov5640_read_reg16_byte(OV5640_CHIP_ID_HIGH_BYTE) << 8;
    return id;
}

void camera_start(uint32_t buffer_address, uint32_t buffer_size, uint8_t is_predictive)
{
    HAL_DCMI_Resume(&hdcmi);
    // HAL_DMA_DeInit(&hdma_dcmi);
    // HAL_DMA_Init(&hdma_dcmi);
    if (is_predictive) {
        HAL_DCMI_Start_DMA(&hdcmi, DCMI_MODE_CONTINUOUS, buffer_address,
                           buffer_size);
    } else {
        HAL_DCMI_Start_DMA(&hdcmi, DCMI_MODE_SNAPSHOT, buffer_address,
                           buffer_size);
    }
    camera_ins.capture_ok = 0;
}

void camera_stop(void)
{
    HAL_DCMI_Suspend(&hdcmi);
    // HAL_DMA_DeInit(&hdma_dcmi);
}

void camera_crop(uint8_t want_x, uint8_t want_y)
{
    uint16_t x = 0;
    uint16_t y = 0;
    switch (camera_ins.resolution) {
        case OV5640_R160x120: // 160x120
            x = 160;
            y = 120;
            break;
        case OV5640_R320x240: // 320x240
            x = 320;
            y = 240;
            break;
        case OV5640_R480x272: // 480x272
            x = 480;
            y = 272;
            break;
        case OV5640_R640x480: // 640x480
            x = 640;
            y = 480;
            break;
        default:
            return;
    }
    HAL_DCMI_ConfigCrop(&hdcmi, x - want_x, (y - want_y) / 2 - 1, want_x * 2 - 1, want_y - 1);
    HAL_DCMI_EnableCrop(&hdcmi);
}

static void camera_enable_mode(uint8_t mode)
{
    if (mode == OV5640_MIPI_MODE) {
        ov5640_write_reg16_byte(OV5640_PAD_OUTPUT_ENABLE01, 0x00);
        ov5640_write_reg16_byte(OV5640_PAD_OUTPUT_ENABLE02, 0x00);
        ov5640_write_reg16_byte(0x302e, 0x08);
        ov5640_write_reg16_byte(OV5640_PCLK_PERIOD, 0x23);
        ov5640_write_reg16_byte(OV5640_SC_PLL_CONTRL0, 0x18);
        ov5640_write_reg16_byte(OV5640_SC_PLL_CONTRL1, 0x12);
        ov5640_write_reg16_byte(OV5640_SC_PLL_CONTRL2, 0x1c);
        ov5640_write_reg16_byte(OV5640_SC_PLL_CONTRL3, 0x13);
        ov5640_write_reg16_byte(OV5640_SYSTEM_ROOT_DIVIDER, 0x01);
        ov5640_write_reg16_byte(0x4814, 0x2a);
        ov5640_write_reg16_byte(OV5640_MIPI_CTRL00, 0x24);
        ov5640_write_reg16_byte(OV5640_PAD_OUTPUT_VALUE00, 0x70);
        ov5640_write_reg16_byte(OV5640_MIPI_CONTROL00, 0x45);
        ov5640_write_reg16_byte(OV5640_FRAME_CTRL02, 0x00);
    } else if (mode == OV5640_DVP_MODE) {
        ov5640_write_reg16_byte(OV5640_PAD_OUTPUT_ENABLE01, 0xff);
        ov5640_write_reg16_byte(OV5640_PAD_OUTPUT_ENABLE02, 0xf3);
        ov5640_write_reg16_byte(0x302e, 0x00);
        ov5640_write_reg16_byte(0x471c, 0x50);
        ov5640_write_reg16_byte(OV5640_MIPI_CTRL00, 0x58);
        ov5640_write_reg16_byte(OV5640_SC_PLL_CONTRL0, 0x18);
        ov5640_write_reg16_byte(OV5640_SC_PLL_CONTRL1, 0x41);
        ov5640_write_reg16_byte(OV5640_SC_PLL_CONTRL2, 0x60);
        ov5640_write_reg16_byte(OV5640_SC_PLL_CONTRL3, 0x13);
        ov5640_write_reg16_byte(OV5640_SYSTEM_ROOT_DIVIDER, 0x01);
    }
}

void camera_set_polarity(uint8_t pclk_polarity, uint8_t href_polarity,
                         uint8_t vsync_polarity)
{
    uint8_t tmp4740 =
        ((pclk_polarity << 5) | (href_polarity << 1) | vsync_polarity);
    ov5640_write_reg16_byte(OV5640_POLARITY_CTRL, tmp4740);
}

void camera_set_resolution(uint8_t resolution)
{
    camera_ins.resolution = resolution;
    switch (resolution) {
        case OV5640_R160x120: // 160x120
            ov5640_write_reg16_byte(OV5640_TIMING_DVPHO_HIGH, 0x00);
            ov5640_write_reg16_byte(OV5640_TIMING_DVPHO_LOW, 0xa0);
            ov5640_write_reg16_byte(OV5640_TIMING_DVPVO_HIGH, 0x00);
            ov5640_write_reg16_byte(OV5640_TIMING_DVPVO_LOW, 0x78);
            break;
        case OV5640_R320x240: // 640x480
            ov5640_write_reg16_byte(OV5640_TIMING_DVPHO_HIGH, 0x01);
            ov5640_write_reg16_byte(OV5640_TIMING_DVPHO_LOW, 0x40);
            ov5640_write_reg16_byte(OV5640_TIMING_DVPVO_HIGH, 0x00);
            ov5640_write_reg16_byte(OV5640_TIMING_DVPVO_LOW, 0xf0);
            break;
        case OV5640_R480x272: // 480x272
            ov5640_write_reg16_byte(OV5640_TIMING_DVPHO_HIGH, 0x01);
            ov5640_write_reg16_byte(OV5640_TIMING_DVPHO_LOW, 0xe0);
            ov5640_write_reg16_byte(OV5640_TIMING_DVPVO_HIGH, 0x01);
            ov5640_write_reg16_byte(OV5640_TIMING_DVPVO_LOW, 0x10);
            break;
        case OV5640_R640x480: // 640x480
            // YUV VGA 30fps, night mode 5fps
            // Input Clock = 24Mhz, PCLK = 56MHz
            ov5640_write_reg16_byte(OV5640_TIMING_X_INC, 0x31);       // X INC
            ov5640_write_reg16_byte(OV5640_TIMING_Y_INC, 0x31);       // Y INC
            ov5640_write_reg16_byte(OV5640_TIMING_HS_HIGH, 0x00);     // HS
            ov5640_write_reg16_byte(OV5640_TIMING_HS_LOW, 0x00);      // HS
            ov5640_write_reg16_byte(OV5640_TIMING_VS_HIGH, 0x00);     // VS
            ov5640_write_reg16_byte(OV5640_TIMING_VS_LOW, 0x04);      // VS
            ov5640_write_reg16_byte(OV5640_TIMING_HW_HIGH, 0x0a);     // HW (HE)
            ov5640_write_reg16_byte(OV5640_TIMING_VH_HIGH, 0x07);     // VH (VE)
            ov5640_write_reg16_byte(OV5640_TIMING_VH_LOW, 0x9b);      // VH (VE)
            ov5640_write_reg16_byte(OV5640_TIMING_DVPHO_HIGH, 0x02);  // DVPHO
            ov5640_write_reg16_byte(OV5640_TIMING_DVPHO_LOW, 0x80);   // DVPHO
            ov5640_write_reg16_byte(OV5640_TIMING_DVPVO_HIGH, 0x01);  // DVPVO
            ov5640_write_reg16_byte(OV5640_TIMING_DVPVO_LOW, 0xe0);   // DVPVO
            ov5640_write_reg16_byte(OV5640_TIMING_HTS_HIGH, 0x07);    // HTS
            ov5640_write_reg16_byte(OV5640_TIMING_HTS_LOW, 0x68);     // HTS
            ov5640_write_reg16_byte(OV5640_TIMING_VTS_HIGH, 0x03);    // VTS
            ov5640_write_reg16_byte(OV5640_TIMING_VTS_LOW, 0xd8);     // VTS
            ov5640_write_reg16_byte(OV5640_TIMING_VOFFSET_LOW, 0x06); // Timing Voffset

            break;
        case OV5640_R800x480: // 800x480
            ov5640_write_reg16_byte(OV5640_TIMING_DVPHO_HIGH, 0x03);
            ov5640_write_reg16_byte(OV5640_TIMING_DVPHO_LOW, 0x20);
            ov5640_write_reg16_byte(OV5640_TIMING_DVPVO_HIGH, 0x01);
            ov5640_write_reg16_byte(OV5640_TIMING_DVPVO_LOW, 0xe0);
            break;
        default:
            break;
    }
    // ov5640_write_reg16_byte(OV5640_SC_PLL_CONTRL1, 0x11);     // PLL
    // ov5640_write_reg16_byte(OV5640_SC_PLL_CONTRL2, 0x46);     // PLL
    // ov5640_write_reg16_byte(OV5640_LIGHTMETER1_TH_LOW, 0x08); // light meter 1 threshold [7:0]
    // ov5640_write_reg16_byte(OV5640_TIMING_TC_REG20, 0x41);    // Sensor flip off, ISP flip on
    // ov5640_write_reg16_byte(OV5640_TIMING_TC_REG21, 0x07);    // Sensor mirror on, ISP mirror on, H binning on

