T0n0T/stm32/drivers/camera.c
    // ov5640_write_reg16_byte(0x3618, 0x00);
    // ov5640_write_reg16_byte(0x3612, 0x29);
    // ov5640_write_reg16_byte(0x3709, 0x52);
    // ov5640_write_reg16_byte(0x370c, 0x03);
    // ov5640_write_reg16_byte(OV5640_AEC_CTRL02, 0x17); // 60Hz max exposure, night mode 5fps
    // ov5640_write_reg16_byte(OV5640_AEC_CTRL03, 0x10); // 60Hz max exposure
    // // banding filters are calculated automatically in camera driver
    // // ov5640_write_reg16_byte(OV5640_AEC_B50_STEP_HIGH, 0x01); // B50 step
    // // ov5640_write_reg16_byte(OV5640_AEC_B50_STEP_LOW, 0x27); // B50 step
    // // ov5640_write_reg16_byte(OV5640_AEC_B60_STEP_HIGH, 0x00); // B60 step
    // // ov5640_write_reg16_byte(OV5640_AEC_B60_STEP_LOW, 0xf6); // B60 step
    // // ov5640_write_reg16_byte(OV5640_AEC_CTRL0D, 0x04); // 60Hz max band
    // // ov5640_write_reg16_byte(OV5640_AEC_CTRL0E, 0x03); // 50Hz max band
    // ov5640_write_reg16_byte(OV5640_AEC_MAX_EXPO_HIGH, 0x17); // 50Hz max exposure, night mode 5fps
    // ov5640_write_reg16_byte(OV5640_AEC_MAX_EXPO_LOW, 0x10);  // 50Hz max exposure
    // ov5640_write_reg16_byte(OV5640_BLC_CTRL04, 0x02);        // BLC 2 lines
    // ov5640_write_reg16_byte(OV5640_SYSREM_RESET02, 0x1c);    // reset JFIFO, SFIFO, JPEG
    // ov5640_write_reg16_byte(OV5640_CLOCK_ENABLE02, 0xc3);    // disable clock of JPEG2x, JPEG
    // ov5640_write_reg16_byte(OV5640_JPG_MODE_SELECT, 0x03);   // JPEG mode 3
    // ov5640_write_reg16_byte(OV5640_JPEG_CTRL07, 0x04);       // Quantization scale
    // ov5640_write_reg16_byte(0x460b, 0x35);
    // ov5640_write_reg16_byte(OV5640_VFIFO_CTRL0C, 0x22);
    // ov5640_write_reg16_byte(OV5640_PCLK_PERIOD, 0x22);   // DVP CLK divider
    // ov5640_write_reg16_byte(0x3824, 0x02);               // DVP CLK divider
    // ov5640_write_reg16_byte(OV5640_ISP_CONTROL01, 0xa3); // SDE on, scale on, UV average off, color matrix on, AWB on
    // ov5640_write_reg16_byte(OV5640_AEC_PK_MANUAL, 0x00); // AEC/AGC on
}

void camera_set_format(uint8_t format)
{
    switch (format) {
        case OV5640_YUV422:
            ov5640_write_reg16_byte(OV5640_FORMAT_CTRL00, 0x30);
            OV5640_DELAY_MS(1);
            ov5640_write_reg16_byte(OV5640_FORMAT_MUX_CTRL, 0x00);
            OV5640_DELAY_MS(1);
            break;
        case OV5640_RGB888:
            ov5640_write_reg16_byte(OV5640_FORMAT_CTRL00, 0x23);
            OV5640_DELAY_MS(1);
            ov5640_write_reg16_byte(OV5640_FORMAT_MUX_CTRL, 0x01);
            OV5640_DELAY_MS(1);
            break;
        case OV5640_Y8:
            ov5640_write_reg16_byte(OV5640_FORMAT_CTRL00, 0x10);
            OV5640_DELAY_MS(1);
            ov5640_write_reg16_byte(OV5640_FORMAT_MUX_CTRL, 0x00);
            OV5640_DELAY_MS(1);
            break;
        case OV5640_JPEG:
            ov5640_write_reg16_byte(OV5640_FORMAT_CTRL00, 0x30);
            OV5640_DELAY_MS(1);
            ov5640_write_reg16_byte(OV5640_FORMAT_MUX_CTRL, 0x00);
            OV5640_DELAY_MS(1);
            // make sure jpg enbale
            uint8_t tmp3821 = ov5640_read_reg16_byte(OV5640_TIMING_TC_REG21);
            tmp3821 |= (1 << 5);
            ov5640_write_reg16_byte(OV5640_TIMING_TC_REG21, tmp3821);
            // reset jfifo,sfifo,jpg
            uint8_t tmp3002 = ov5640_read_reg16_byte(OV5640_SYSREM_RESET02);
            tmp3002 &= ~((1 << 2) | (1 << 3) | (1 << 4));
            ov5640_write_reg16_byte(OV5640_SYSREM_RESET02, tmp3002);
            // enable jpeg clock
            uint8_t tmp3006 = ov5640_read_reg16_byte(OV5640_CLOCK_ENABLE02);
            tmp3006 |= ((1 << 3) | (1 << 5));
            ov5640_write_reg16_byte(OV5640_CLOCK_ENABLE02, tmp3006);
            break;
        case OV5640_RGB565:
            ov5640_write_reg16_byte(OV5640_FORMAT_CTRL00, 0x6f);
            OV5640_DELAY_MS(1);
            ov5640_write_reg16_byte(OV5640_FORMAT_MUX_CTRL, 0x01);
            OV5640_DELAY_MS(1);
            break;
        default:
            break;
    }
}

void camera_set_brightness(uint8_t level)
{
    static const uint16_t OV5640_BRIGHTNESS_REG_VAL[][2] = {
        {0x40, 0x09}, /* -4 */
        {0x30, 0x09}, /* -3 */
        {0x20, 0x09}, /* -2 */
        {0x10, 0x09}, /* -1 */
        {0x00, 0x01}, /* +0 */
        {0x10, 0x01}, /* +1 */
        {0x20, 0x01}, /* +2 */
        {0x30, 0x01}, /* +3 */
        {0x40, 0x01}, /* +4 */
    };
    ov5640_write_reg16_byte(OV5640_SRM_GROUP_ACCESS, 0X03);

    ov5640_write_reg16_byte(OV5640_SDE_CTRL7,
                            OV5640_BRIGHTNESS_REG_VAL[level][0]);
    ov5640_write_reg16_byte(OV5640_SDE_CTRL8,
                            OV5640_BRIGHTNESS_REG_VAL[level][1]);

    ov5640_write_reg16_byte(OV5640_SRM_GROUP_ACCESS, 0X13);
    ov5640_write_reg16_byte(OV5640_SRM_GROUP_ACCESS, 0Xa3);
}

void camera_set_contrast(uint8_t level)
{
    static const uint16_t OV5640_CONTRAST_REG_VAL[][2] = {
        {0x14, 0x14}, /* -3 */
        {0x18, 0x18}, /* -2 */
        {0x1c, 0x1c}, /* -1 */
        {0x00, 0x20}, /* +0 */
        {0x10, 0x24}, /* +1 */
        {0x18, 0x28}, /* +2 */
        {0x1c, 0x2c}, /* +3 */
    };
    ov5640_write_reg16_byte(OV5640_SRM_GROUP_ACCESS, 0X03);

    ov5640_write_reg16_byte(OV5640_SDE_CTRL5, OV5640_CONTRAST_REG_VAL[level][0]);
    ov5640_write_reg16_byte(OV5640_SDE_CTRL6, OV5640_CONTRAST_REG_VAL[level][1]);

    ov5640_write_reg16_byte(OV5640_SRM_GROUP_ACCESS, 0X13);
    ov5640_write_reg16_byte(OV5640_SRM_GROUP_ACCESS, 0Xa3);
}

void camera_set_saturation(uint8_t level)
{
    static const uint16_t OV5640_SATURATION_REG_VAL[][11] = {
        {0x1c, 0x5a, 0x06, 0x0c, 0x30, 0x3d, 0x3e, 0x3d, 0x01, 0x98,
         0x01}, /* -3 */
        {0x1c, 0x5a, 0x06, 0x10, 0x3d, 0x4d, 0x4e, 0x4d, 0x01, 0x98,
         0x01}, /* -2 */
        {0x1c, 0x5a, 0x06, 0x15, 0x52, 0x66, 0x68, 0x66, 0x02, 0x98,
         0x01}, /* -1 */
        {0x1c, 0x5a, 0x06, 0x1a, 0x66, 0x80, 0x82, 0x80, 0x02, 0x98,
         0x01}, /* +0 */
        {0x1c, 0x5a, 0x06, 0x1f, 0x7a, 0x9a, 0x9c, 0x9a, 0x02, 0x98,
         0x01}, /* +1 */
        {0x1c, 0x5a, 0x06, 0x24, 0x8f, 0xb3, 0xb6, 0xb3, 0x03, 0x98,
         0x01}, /* +2 */
        {0x1c, 0x5a, 0x06, 0x2b, 0xab, 0xd6, 0xda, 0xd6, 0x04, 0x98,
         0x01}, /* +3 */
    };
    ov5640_write_reg16_byte(OV5640_SRM_GROUP_ACCESS, 0X03);

