T0n0T/stm32/drivers/camera.c
    ov5640_write_reg16_byte(OV5640_CMX1, OV5640_SATURATION_REG_VAL[level][0]);
    ov5640_write_reg16_byte(OV5640_CMX2, OV5640_SATURATION_REG_VAL[level][1]);
    ov5640_write_reg16_byte(OV5640_CMX3, OV5640_SATURATION_REG_VAL[level][2]);
    ov5640_write_reg16_byte(OV5640_CMX4, OV5640_SATURATION_REG_VAL[level][3]);
    ov5640_write_reg16_byte(OV5640_CMX5, OV5640_SATURATION_REG_VAL[level][4]);
    ov5640_write_reg16_byte(OV5640_CMX6, OV5640_SATURATION_REG_VAL[level][5]);
    ov5640_write_reg16_byte(OV5640_CMX7, OV5640_SATURATION_REG_VAL[level][6]);
    ov5640_write_reg16_byte(OV5640_CMX8, OV5640_SATURATION_REG_VAL[level][7]);
    ov5640_write_reg16_byte(OV5640_CMX9, OV5640_SATURATION_REG_VAL[level][8]);
    ov5640_write_reg16_byte(OV5640_CMXSIGN_HIGH,
                            OV5640_SATURATION_REG_VAL[level][9]);
    ov5640_write_reg16_byte(OV5640_CMXSIGN_LOW,
                            OV5640_SATURATION_REG_VAL[level][10]);

    ov5640_write_reg16_byte(OV5640_SRM_GROUP_ACCESS, 0X13);
    ov5640_write_reg16_byte(OV5640_SRM_GROUP_ACCESS, 0Xa3);
}

void camera_set_exposure_compensation(uint8_t level)
{
    static const uint16_t OV5640_EXPOSURE_COMPENSATION_REG_VAL[][6] = {
        {0x10, 0x08, 0x10, 0x08, 0x20, 0x10}, /* -3 */
        {0x28, 0x18, 0x41, 0x20, 0x18, 0x10}, /* -2 */
        {0x30, 0x28, 0x61, 0x30, 0x28, 0x10}, /* -1 */
        {0x38, 0x30, 0x61, 0x38, 0x30, 0x10}, /* +0 */
        {0x40, 0x38, 0x71, 0x40, 0x38, 0x10}, /* +1 */
        {0x50, 0x48, 0x90, 0x50, 0x48, 0x20}, /* +2 */
        {0x60, 0x58, 0xa0, 0x60, 0x58, 0x10}, /* +3 */
    };
    ov5640_write_reg16_byte(OV5640_AEC_CTRL0F,
                            OV5640_EXPOSURE_COMPENSATION_REG_VAL[level][0]);
    ov5640_write_reg16_byte(OV5640_AEC_CTRL10,
                            OV5640_EXPOSURE_COMPENSATION_REG_VAL[level][1]);
    ov5640_write_reg16_byte(OV5640_AEC_CTRL11,
                            OV5640_EXPOSURE_COMPENSATION_REG_VAL[level][2]);
    ov5640_write_reg16_byte(OV5640_AEC_CTRL1B,
                            OV5640_EXPOSURE_COMPENSATION_REG_VAL[level][3]);
    ov5640_write_reg16_byte(OV5640_AEC_CTRL1E,
                            OV5640_EXPOSURE_COMPENSATION_REG_VAL[level][4]);
    ov5640_write_reg16_byte(OV5640_AEC_CTRL1F,
                            OV5640_EXPOSURE_COMPENSATION_REG_VAL[level][5]);
}

void camera_set_lightmode(uint8_t mode)
{
    static const uint16_t OV5640_LIGHT_MODE_REG_VAL[][7] = {
        {0x00, 0x04, 0x00, 0x04, 0x00, 0x04, 0x00}, /* Auto */
        {0x01, 0x06, 0x1c, 0x04, 0x00, 0x04, 0xf3}, /* Sunny */
        {0x01, 0x05, 0x48, 0x04, 0x00, 0x07, 0xcf}, /* Office */
        {0x01, 0x06, 0x48, 0x04, 0x00, 0x04, 0xd3}, /* Cloudy */
        {0x01, 0x04, 0x10, 0x04, 0x00, 0x08, 0x40}, /* Home */
    };
    ov5640_write_reg16_byte(OV5640_SRM_GROUP_ACCESS, 0X03);

    ov5640_write_reg16_byte(OV5640_AWB_MANUAL_CONTROL,
                            OV5640_LIGHT_MODE_REG_VAL[mode][0]);
    ov5640_write_reg16_byte(OV5640_AWB_R_GAIN_MSB,
                            OV5640_LIGHT_MODE_REG_VAL[mode][1]);
    ov5640_write_reg16_byte(OV5640_AWB_R_GAIN_LSB,
                            OV5640_LIGHT_MODE_REG_VAL[mode][2]);
    ov5640_write_reg16_byte(OV5640_AWB_G_GAIN_MSB,
                            OV5640_LIGHT_MODE_REG_VAL[mode][3]);
    ov5640_write_reg16_byte(OV5640_AWB_G_GAIN_LSB,
                            OV5640_LIGHT_MODE_REG_VAL[mode][4]);
    ov5640_write_reg16_byte(OV5640_AWB_B_GAIN_MSB,
                            OV5640_LIGHT_MODE_REG_VAL[mode][5]);
    ov5640_write_reg16_byte(OV5640_AWB_B_GAIN_LSB,
                            OV5640_LIGHT_MODE_REG_VAL[mode][6]);

    ov5640_write_reg16_byte(OV5640_SRM_GROUP_ACCESS, 0X13);
    ov5640_write_reg16_byte(OV5640_SRM_GROUP_ACCESS, 0Xa3);
}

void camera_set_nightmode(uint8_t mode)
{
    uint8_t tmp3a00 = ov5640_read_reg16_byte(OV5640_AEC_CTRL00);
    if (mode == NIGHT_MODE_ENABLE) {
        tmp3a00 |= 0x04; // Enable night mode
    } else {
        tmp3a00 &= ~0x04; // Disable night mode
    }
    ov5640_write_reg16_byte(OV5640_AEC_CTRL00, tmp3a00);
}

void camera_set_mirror_flip(uint8_t mode)
{
    uint8_t tmp1 = ov5640_read_reg16_byte(OV5640_TIMING_TC_REG20) & 0xf9;
    uint8_t tmp2 = ov5640_read_reg16_byte(OV5640_TIMING_TC_REG21) & 0xf9;
    switch (mode) {
        case 0: // Normal
            tmp1 |= 0x00;
            tmp2 |= 0x00;
            break;
        case 1: // Mirror
            tmp1 |= 0x00;
            tmp2 |= 0x06;
            break;
        case 2: // Flip
            tmp1 |= 0x06;
            tmp2 |= 0x00;
            break;
        case 3: // Mirror + Flip
            tmp1 |= 0x06;
            tmp2 |= 0x06;
            break;
        default:
            break;
    }
    ov5640_write_reg16_byte(OV5640_TIMING_TC_REG20, tmp1);
    ov5640_write_reg16_byte(OV5640_TIMING_TC_REG21, tmp2);
}

void camera_init(void)
{
    extern void MX_DCMI_Init(void);
    MX_DCMI_Init();

    /* Initialization sequence for OV5640 */
    static const uint16_t OV5640_INIT_SEQ[][2] = {
        {OV5640_SCCB_SYSTEM_CTRL1, 0x11}, // system clock from pad, bit[1]
        {OV5640_SYSTEM_CTROL0, 0x82},     // software reset, bit[7]
        // maybe need delay 5ms
        {OV5640_SYSTEM_CTROL0, 0x42},     // software power down, bit[6]
        {OV5640_SCCB_SYSTEM_CTRL1, 0x03}, // system clock from PLL, bit[1]
        {OV5640_PAD_OUTPUT_ENABLE01,
         0xff},                             // FREX, Vsync, HREF, PCLK, D[9:6] output enable
        {OV5640_PAD_OUTPUT_ENABLE02, 0xff}, // D[5:0], GPIO[1:0] output enable
        {OV5640_SC_PLL_CONTRL0, 0x1a},      // MIPI 10-bit
        {OV5640_SC_PLL_CONTRL3,
         0x13}, // PLL root divider, bit[4], PLL pre-divider, bit[3:0]
        {OV5640_SYSTEM_ROOT_DIVIDER,
         0x01}, // PCLK root divider, bit[5:4], SCLK2x root divider, bit[3:2]

        // SCLK root divider, bit[1:0]
        {0x3630, 0x36},
        {0x3631, 0x0e},
        {0x3632, 0xe2},
        {0x3633, 0x12},
        {0x3621, 0xe0},
        {0x3704, 0xa0},
        {0x3703, 0x5a},
        {0x3715, 0x78},
        {0x3717, 0x01},
        {0x370b, 0x60},
        {0x3705, 0x1a},
        {0x3905, 0x02},
        {0x3906, 0x10},
        {0x3901, 0x0a},
        {0x3731, 0x12},
        {0x3600, 0x08}, // VCM control
        {0x3601, 0x33}, // VCM control
        {0x302d, 0x60}, // system control
        {0x3620, 0x52},
        {0x371b, 0x20},
        {0x471c, 0x50},
        {OV5640_AEC_CTRL13, 0x43},            // pre-gain = 1.047x
        {OV5640_AEC_GAIN_CEILING_HIGH, 0x00}, // gain ceiling
        {OV5640_AEC_GAIN_CEILING_LOW, 0xf8},  // gain ceiling = 15.5x
        {0x3635, 0x13},
        {0x3636, 0x03},
        {0x3634, 0x40},
        {0x3622, 0x01},
        // 50/60Hz detection 50/60Hz 灯光条纹过滤
        {OV5640_5060HZ_CTRL01, 0x34},       // Band auto, bit[7]
        {OV5640_5060HZ_CTRL04, 0x28},       // threshold low sum
        {OV5640_5060HZ_CTRL05, 0x98},       // threshold high sum
        {OV5640_LIGHTMETER1_TH_HIGH, 0x00}, // light meter 1 threshold[15:8]
        {OV5640_LIGHTMETER1_TH_LOW, 0x08},  // light meter 1 threshold[7:0]
        {OV5640_LIGHTMETER2_TH_HIGH, 0x00}, // light meter 2 threshold[15:8]
        {OV5640_LIGHTMETER2_TH_LOW, 0x1c},  // light meter 2 threshold[7:0]
        {OV5640_SAMPLE_NUMBER_HIGH, 0x9c},  // sample number[15:8]
        {OV5640_SAMPLE_NUMBER_LOW, 0x40},   // sample number[7:0]
        {OV5640_TIMING_HOFFSET_HIGH, 0x00}, // Timing Hoffset[11:8]
        {OV5640_TIMING_HOFFSET_LOW, 0x10},  // Timing Hoffset[7:0]
        {OV5640_TIMING_VOFFSET_HIGH, 0x00}, // Timing Voffset[10:8]
        {0x3708, 0x64},
        {OV5640_BLC_CTRL01, 0x02},     // BLC start from line 2
        {OV5640_BLC_CTRL05, 0x1a},     // BLC always update
        {OV5640_SYSREM_RESET00, 0x00}, // enable blocks
        {OV5640_CLOCK_ENABLE00, 0xff}, // enable clocks
        {OV5640_MIPI_CONTROL00, 0x58}, // MIPI power down, DVP enable
        {0x302e, 0x00},
        {OV5640_FORMAT_CTRL00, 0x30},   // YUV 422, YUYV
        {OV5640_FORMAT_MUX_CTRL, 0x00}, // YUV 422
        {0x440e, 0x00},
        {OV5640_ISP_CONTROL00,
         0xa7}, // Lenc on, raw gamma on, BPC on, WPC on, CIP on
        // AEC target 自动曝光控制
        {OV5640_AEC_CTRL0F, 0x30}, // stable range in high
        {OV5640_AEC_CTRL10, 0x28}, // stable range in low
        {OV5640_AEC_CTRL1B, 0x30}, // stable range out high
        {OV5640_AEC_CTRL1E, 0x26}, // stable range out low
        {OV5640_AEC_CTRL11, 0x60}, // fast zone high
        {OV5640_AEC_CTRL1F, 0x14}, // fast zone low
        // Lens correction for ? 镜头补偿
        {OV5640_GMTRX00, 0x23},
        {OV5640_GMTRX01, 0x14},
        {OV5640_GMTRX02, 0x0f},
        {OV5640_GMTRX03, 0x0f},
        {OV5640_GMTRX04, 0x12},
        {OV5640_GMTRX05, 0x26},
        {OV5640_GMTRX10, 0x0c},
        {OV5640_GMTRX11, 0x08},
        {OV5640_GMTRX12, 0x05},
        {OV5640_GMTRX13, 0x05},
        {OV5640_GMTRX14, 0x08},
        {OV5640_GMTRX15, 0x0d},
        {OV5640_GMTRX20, 0x08},
        {OV5640_GMTRX21, 0x03},
        {OV5640_GMTRX22, 0x00},
        {OV5640_GMTRX23, 0x00},
        {OV5640_GMTRX24, 0x03},
        {OV5640_GMTRX25, 0x09},
        {OV5640_GMTRX30, 0x07},
        {OV5640_GMTRX31, 0x03},
        {OV5640_GMTRX32, 0x00},
        {OV5640_GMTRX33, 0x01},
        {OV5640_GMTRX34, 0x03},
        {OV5640_GMTRX35, 0x08},
        {OV5640_GMTRX40, 0x0d},
        {OV5640_GMTRX41, 0x08},
        {OV5640_GMTRX42, 0x05},
        {OV5640_GMTRX43, 0x06},
        {OV5640_GMTRX44, 0x08},
        {OV5640_GMTRX45, 0x0e},
        {OV5640_GMTRX50, 0x29},
        {OV5640_GMTRX51, 0x17},
        {OV5640_GMTRX52, 0x11},
        {OV5640_GMTRX53, 0x11},
        {OV5640_GMTRX54, 0x15},
        {OV5640_GMTRX55, 0x28},
        {OV5640_BRMATRX00, 0x46},
        {OV5640_BRMATRX01, 0x26},
        {OV5640_BRMATRX02, 0x08},
        {OV5640_BRMATRX03, 0x26},
        {OV5640_BRMATRX04, 0x64},
        {OV5640_BRMATRX05, 0x26},
        {OV5640_BRMATRX06, 0x24},
        {OV5640_BRMATRX07, 0x22},
        {OV5640_BRMATRX08, 0x24},
        {OV5640_BRMATRX09, 0x24},
        {OV5640_BRMATRX20, 0x06},
        {OV5640_BRMATRX21, 0x22},
        {OV5640_BRMATRX22, 0x40},
        {OV5640_BRMATRX23, 0x42},
        {OV5640_BRMATRX24, 0x24},
        {OV5640_BRMATRX30, 0x26},
        {OV5640_BRMATRX31, 0x24},
        {OV5640_BRMATRX32, 0x22},
        {OV5640_BRMATRX33, 0x22},
        {OV5640_BRMATRX34, 0x26},
        {OV5640_BRMATRX40, 0x44},
        {OV5640_BRMATRX41, 0x24},
        {OV5640_BRMATRX42, 0x26},
        {OV5640_BRMATRX43, 0x28},
        {OV5640_BRMATRX44, 0x42},
        {OV5640_LENC_BR_OFFSET, 0xce}, // lenc BR offset
        // AWB 自动白平衡
        {OV5640_AWB_CTRL00, 0xff}, // AWB B block
        {OV5640_AWB_CTRL01, 0xf2}, // AWB control
        {OV5640_AWB_CTRL02,
         0x00},                    // [7:4] max local counter, [3:0] max fast counter
        {OV5640_AWB_CTRL03, 0x14}, // AWB advanced
        {OV5640_AWB_CTRL04, 0x25},
        {OV5640_AWB_CTRL05, 0x24},
        {OV5640_AWB_CTRL06, 0x09},
        {OV5640_AWB_CTRL07, 0x09},
        {OV5640_AWB_CTRL08, 0x09},
        {OV5640_AWB_CTRL09, 0x75},
        {OV5640_AWB_CTRL10, 0x54},
        {OV5640_AWB_CTRL11, 0xe0},
        {OV5640_AWB_CTRL12, 0xb2},
        {OV5640_AWB_CTRL13, 0x42},
        {OV5640_AWB_CTRL14, 0x3d},
        {OV5640_AWB_CTRL15, 0x56},
        {OV5640_AWB_CTRL16, 0x46},
        {OV5640_AWB_CTRL17, 0xf8}, // AWB top limit
        {OV5640_AWB_CTRL18, 0x04}, // AWB bottom limit
        {OV5640_AWB_CTRL19, 0x70}, // red limit
        {OV5640_AWB_CTRL20, 0xf0}, // green limit
        {OV5640_AWB_CTRL21, 0xf0}, // blue limit
        {OV5640_AWB_CTRL22, 0x03}, // AWB control
        {OV5640_AWB_CTRL23, 0x01}, // local limit
        {OV5640_AWB_CTRL24, 0x04},
        {OV5640_AWB_CTRL25, 0x12},
        {OV5640_AWB_CTRL26, 0x04},
        {OV5640_AWB_CTRL27, 0x00},
        {OV5640_AWB_CTRL28, 0x06},
        {OV5640_AWB_CTRL29, 0x82},
        {OV5640_AWB_CTRL30, 0x38}, // AWB control
        // Gamma 伽玛曲线
        {OV5640_GAMMA_CTRL00, 0x01}, // Gamma bias plus on, bit[0]
        {OV5640_GAMMA_YST00, 0x08},
        {OV5640_GAMMA_YST01, 0x14},
        {OV5640_GAMMA_YST02, 0x28},
        {OV5640_GAMMA_YST03, 0x51},
        {OV5640_GAMMA_YST04, 0x65},
        {OV5640_GAMMA_YST05, 0x71},
        {OV5640_GAMMA_YST06, 0x7d},
        {OV5640_GAMMA_YST07, 0x87},
        {OV5640_GAMMA_YST08, 0x91},

