T0n0T/stm32/drivers/camera.c
        {OV5640_GAMMA_YST09, 0x9a},
        {OV5640_GAMMA_YST0A, 0xaa},
        {OV5640_GAMMA_YST0B, 0xb8},
        {OV5640_GAMMA_YST0C, 0xcd},
        {OV5640_GAMMA_YST0D, 0xdd},
        {OV5640_GAMMA_YST0E, 0xea},
        {OV5640_GAMMA_YST0F, 0x1d},
        // color matrix 色彩矩阵
        {OV5640_CMX1, 0x1e},         // CMX1 for Y
        {OV5640_CMX2, 0x5b},         // CMX2 for Y
        {OV5640_CMX3, 0x08},         // CMX3 for Y
        {OV5640_CMX4, 0x0a},         // CMX4 for U
        {OV5640_CMX5, 0x7e},         // CMX5 for U
        {OV5640_CMX6, 0x88},         // CMX6 for U
        {OV5640_CMX7, 0x7c},         // CMX7 for V
        {OV5640_CMX8, 0x6c},         // CMX8 for V
        {OV5640_CMX9, 0x10},         // CMX9 for V
        {OV5640_CMXSIGN_HIGH, 0x01}, // sign[9]
        {OV5640_CMXSIGN_LOW, 0x98},  // sign[8:1]
        // UV adjust UV 色彩饱和度调整
        {OV5640_SDE_CTRL0, 0x06}, // saturation on, bit[1]
        {OV5640_SDE_CTRL3, 0x40},
        {OV5640_SDE_CTRL4, 0x10},
        {OV5640_SDE_CTRL9, 0x10},
        {OV5640_SDE_CTRL10, 0x00},
        {OV5640_SDE_CTRL11, 0xf8},
        {OV5640_ISP_MISC0, 0x40}, // enable manual offset of contrast
        // CIP 锐化和降噪
        {OV5640_CIP_SHARPENMT_TH1, 0x08},     // CIP sharpen MT threshold 1
        {OV5640_CIP_SHARPENMT_TH2, 0x30},     // CIP sharpen MT threshold 2
        {OV5640_CIP_SHARPENMT_OFFSET1, 0x10}, // CIP sharpen MT offset 1
        {OV5640_CIP_SHARPENMT_OFFSET2, 0x00}, // CIP sharpen MT offset 2
        {OV5640_CIP_DNS_TH1, 0x08},           // CIP DNS threshold 1
        {OV5640_CIP_DNS_TH2, 0x30},           // CIP DNS threshold 2
        {OV5640_CIP_DNS_OFFSET1, 0x08},       // CIP DNS offset 1
        {OV5640_CIP_DNS_OFFSET2, 0x16},
        {OV5640_CIP_SHARPENTH_TH1, 0x08},     // CIP sharpen TH threshold 1
        {OV5640_CIP_SHARPENTH_TH2, 0x30},     // CIP sharpen TH threshold 2
        {OV5640_CIP_SHARPENTH_OFFSET1, 0x04}, // CIP sharpen TH offset 1
        {OV5640_CIP_SHARPENTH_OFFSET2, 0x06}, // CIP sharpen TH offset 2
        {0x5025, 0x00},
        {OV5640_SYSTEM_CTROL0, 0x02}, // wake up from standby, bit[6]
    };
    ov5640_write_reg16_byte(OV5640_INIT_SEQ[0][0], OV5640_INIT_SEQ[0][1]);
    ov5640_write_reg16_byte(OV5640_INIT_SEQ[0][0], OV5640_INIT_SEQ[1][1]);
    OV5640_DELAY_MS(5); // wait for reset
    for (uint32_t i = 2; i < sizeof(OV5640_INIT_SEQ) / sizeof(OV5640_INIT_SEQ[0]);
         i++) {
        ov5640_write_reg16_byte(OV5640_INIT_SEQ[i][0], OV5640_INIT_SEQ[i][1]);
    }
    camera_enable_mode(OV5640_DVP_MODE);
    camera_set_resolution(OV5640_R640x480);
    camera_set_format(OV5640_RGB565);
    camera_set_polarity(OV5640_POLARITY_PCLK_HIGH, OV5640_POLARITY_HREF_LOW,
                        OV5640_POLARITY_VSYNC_LOW); // PCLK, HREF, VSYNC polarity
}

void camera_pattern_test(void)
{
    ov5640_write_reg16_byte(OV5640_PRE_ISP_TEST_SETTING1, 0x80);
    ov5640_write_reg16_byte(OV5640_TEST_PATTERN, 0x00); // test pattern
}
